MohamadHammoud99/Automatic-Water-Irrigation-System/Microcontroller_PIC18F_Project.c
#include <stdio.h>
#include <p18f458.h>

#pragma config WDT = OFF

#define ldata PORTD            //PORTD = LCD data pins
#define   rs   PORTEbits.RE0   //rs = PORTE.0
#define   rw   PORTEbits.RE1   //rw = PORTE.1
#define   en   PORTEbits.RE2   //en = PORTE.2

#define   c1   PORTBbits.RB0
#define   c2   PORTBbits.RB1
#define   c3   PORTBbits.RB2

#define   r1   PORTBbits.RB3
#define   r2   PORTBbits.RB4
#define   r3   PORTBbits.RB5
#define   r4   PORTBbits.RB6

#define   PUMP1    PORTCbits.RC0
#define   PUMP2    PORTCbits.RC1
#define   GLED     PORTCbits.RC2
#define   RLED     PORTCbits.RC3

#define   ESENSOR   PORTAbits.RA4
#define   FSENSOR   PORTAbits.RA5

//Functions Definitions

void MSDelay(unsigned int);    

void lcdcmd(unsigned char);
void lcddata(unsigned char);
void lcd_ini (void);
void LCD_write_string(static char *str);

unsigned int  Temperature (void);
unsigned int  MOISTURE (void);

void chk_tank (void);
void IRRIGATION_AUTO2 (unsigned int );
void IRRIGATION_MAN (void);

void Stop (void);
void SError (void);
void ALLError(void);

void main()
{
    unsigned int e;
    unsigned char msg1[] = "1:AUTOMATIC";   
    unsigned char msg2[] = "2:MANUAL 3:STOP";
    //unsigned char msg3[] = "PROCESS OFF";
    //unsigned char msg4[] = "SENSOR ERROR";  
    //unsigned char msg5[] = "FIILING TANK";
    //unsigned char msg6[] = "IRRIGATING";
    //unsigned char msg7[] = "RESET SYSTEM";
    //unsigned char msg8[] = "AFTER SOLVING";
  
    TRISA = 0b11111111;     //Make PORTA input
    TRISB = 0b10000000;     //Make PORTB output  
    TRISC = 0b00000000;     //Make PORTB output
    TRISD = 0b00000000;     //Make PORTD output
    TRISE = 0b00000000;     //Make PORTE output
    
    PORTB = 0b11111111;     //Initialize PORTB at ONES
    PORTC = 0b00000000;     //Initialize PORTB at ZEROS
        
    ADCON1 = 0x0F;          //Configuring the PORTE pins as digital I/O
   
    while(1)                //LOOP
    {
    PORTB = 0xFF;           //Or PORTB=11111111 C1=C2=C3=1 are initialized by the Keypad
    r1 = r2 = r3 = r4 = 0;  //Initializing the Rows
    //Or PORTB = 0x0F
 
    GLED = 1;       //Turn ON Green LED (Process ON)
    RLED = 0;       //Turn OFF Red LED (Process ON)
 
    MSDelay(25);                //Waits for a short amount of time to for a key to be pressed
    if (c1 == 0)                //Detect 1st column (key '1' of Keypad) ---> Automatic Mode
    { 
      chk_tank();               //Call the chk_tank function to check the tank level and fill its initially before the irrigation process 
      MSDelay(250);             //Call the MSDelay function
        while(1)                //Loop for the Automatic Irrigation process
        {   
            e =  MOISTURE() ;           //Call the MOISTURE function that displays the moisture value and compare it with 70% and
                                        //take the convenient decision 
            IRRIGATION_AUTO2(e);    //Call the IRRIGATION_AUTO function
            MSDelay(10);                
        }  
    }
    MSDelay(400);
    PORTB = 0xFF;               //Re-initializing the Columns (of Keypad)
    r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
    //Or PORTB = 0x0F
    
    GLED = 1;               //Turn ON Green LED (Process ON)
    if (c2 == 0)            //Detect 2nd column (key '2' of Keypad) ---> Manual Mode
        {  
            IRRIGATION_MAN();   //Call the IRRIGATION_MAN function
            MSDelay(10);
        }
    MSDelay(50);
    PORTB = 0xFF;               //Initializing the Columns
    r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
                            
    if (c3 == 0) {              //Detect 3rd column (key '3' of Keypad) ---> Stop all processes
                   Stop();      //Call the Stop function to stop all Processes
                 }
 
    lcd_ini();                  //Initializing the LCD
    LCD_write_string(msg1);     //Call the LCD_write_string function to write "1:AUTOMATIC" on the Screen
    lcdcmd(192);                //Set the Cursor on 2nd line in LCD screen
    LCD_write_string(msg2);     //Call the LCD_write_string function to write "2:MANUAL 3:STOP" on the Screen
    MSDelay(1500);              //Delay to display these messages for more time to the user
    }
}

//FUNCTIONS BODY

void chk_tank (void)            //Function that check if the tank is full or no in order to fill it
   {    
        unsigned char msg5[] = "FIILING TANK";
        
        if(FSENSOR != 1 || ESENSOR !=1)     //Check if the Full or Empty Sensor switches detect water    
        {
        while(FSENSOR != 1)     //Check if the Full Sensor switch detects water
            {
            PUMP1 = 1;              //Activate the Tank Filling Pump
            PUMP2 = 0;              //Deactivate the Irrigation Pump
            lcd_ini();              //Initializing the LCD  
            LCD_write_string(msg5); //Call the LCD_write_string function to write "FIILING TANK" on the Screen   
            MSDelay(400);           //Delay to display these messages for more time to the user
            }
            PUMP1 = 0;              //Deactivate the Tank Filling Pump the Full Sensor detects water
            MSDelay(25);  
 
        if(c2 == 0) {               //This condition is related to the IRRIGATION_MAN function to re-check tank in some conditions
                        PUMP2 = 0;          //Deactivate the Irrigation Pump
                        MSDelay(250);    
                        IRRIGATION_MAN();   //Re-Call the IRRIGATION_MAN function
                    }           
            PUMP1 = 0;  //Deactivate the Tank Filling Pump the Full Sensor detects water
        }
        else
            PUMP1 = 0;  //Deactivate the Tank Filling Pump the Full Sensor detects water
   }

void IRRIGATION_AUTO2 (unsigned int t)      //Function that is responsible for the Automatic Water Irrigation Process, Controlled by several sensors 
{                                           //'t' is the actual Moisture value;
    unsigned int t1, m1;
    unsigned char msg6[] = "IRRIGATING";   

    ALLError();        //Call the ALLError Function to detect ALL possible Errors(Sensors errors and Warning to high temperature)
    if( t < 50 && ESENSOR == 1 )          //'t' is the actual Moisture value;
    {
        MSDelay(100); 
        PORTB = 0xFF;               //Initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //Or PORTB = 0x0F
        if (c3 == 0) { 
                        Stop();     //Call the Stop function to stop all Processes
                    }        
        MSDelay(100);
        PORTB = 0xFF;               //Re-initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //Or PORTB = 0x0F
        MSDelay(100);
        PUMP2 = 1;          //Activate the Irrigation Pump
        GLED = 1;           //Turn ON Green LED (Process ON)
        RLED = 0;           //Turn OFF Red LED (Process ON)
        lcd_ini();          //Initializing the LCD
        MSDelay(20);
        LCD_write_string(msg6);     //Call the LCD_write_string function to write "IRRIGATING" on the Screen
        MSDelay(400);               //Delay to display these messages for more time to the user
    }
    if(t > 70 || ESENSOR != 1 )      //'t' is the actual Moisture value;
    {   
        MSDelay(100);
        PORTB = 0xFF;               //Initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //Or PORTB = 0x0F
        
