MohamadHammoud99/Automatic-Water-Irrigation-System/Microcontroller_PIC18F_Project.c
        if (c3 == 0) { 
                        Stop();     //Call the Stop function to stop all Processes
                    } 
        MSDelay(100);
        PORTB = 0xFF;               //Re-initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //Or PORTB = 0x0F
        
        MSDelay(100);
        PUMP2  = 0 ;            //Deactivate the Irrigation Pump
        MSDelay(100);
        ALLError();             //Call the ALLError Function to detect ALL possible Errors(Sensors errors and Warning to high temperature)
        chk_tank();             //Call the chk_tank function to check the tank level and fill it if it is required
        t1 = Temperature();     //Call the Temperature function that displays the temperature value
    }
    
        m1 = MOISTURE();
        lcd_ini();              //Initializing the LCD
        t1 = Temperature();     //Call the Temperature function that displays the temperature value
        MSDelay(20);
}

void IRRIGATION_MAN (void)      //Function that is responsible for the Manual Irrigation Process, Controlled by the user
{    
    unsigned char msg6[] = "IRRIGATING";
    unsigned int t1 , m2 ;
        
    while(ESENSOR  == 1)        //Tank is not fully Empty
    {   
        SError();               //Call the SError Function to detect Sensors Errors
        if(c2 == 0){            //Check if the key '2' of Keypad is pressed ---> Manual Mode
                     if(FSENSOR == 1) PUMP1 = 0;         //Deactivate the Tank Filling Pump if the Full Sensor detects water
                    }                          
        MSDelay(100);
        PORTB=0xFF;                 //Re-initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //OR PORTB = 0x0F
        if (c3 == 0) Stop();        //Check if the key '3' of Keypad is pressed ---> Stop all processes, Turn OFF Green LED,
                                    //Turn ON Red LED and Print "PROCESS OFF" On the Screen
        MSDelay(100);
        PORTB=0xFF;                 //Re-initializing the Columns (of Keypad)
        r1 = r2 = r3 = r4 = 0;      //Initializing the Rows
        //OR PORTB = 0x0F
        
        
        PUMP2 = 1;      //Activate the Irrigation Pump
        GLED = 1;       //Turn ON Green LED (Process ON)
        RLED = 0;       //Turn OFF Red LED (Process ON)
        
        lcd_ini();      //Initializing the LCD
        MSDelay(15);
        LCD_write_string(msg6);     //Call the LCD_write_string function to write "IRRIGATING" on the Screen
        MSDelay(200);               //Delay to display these messages for more time to the user
        m2 = MOISTURE ();           //Call the MOISTURE function that displays the moisture value and compare it with 70% and
                                    //take the convenient decision       
        MSDelay(80);
        lcdcmd(192);                //Set the Cursor on 2nd line in LCD screen
        t1 = Temperature();         //Call the Temperature function that displays the temperature value 
    }
  if(ESENSOR != 1)      //Tank is fully Empty
    {   SError();       //Call the SError Function to detect Sensors Errors
        chk_tank();     //Call the chk_tank function to check the tank level and fill it if it is required 
        }
  }


    unsigned int Temperature (void)         //Function that reads from Temperature Sensor, Display his value on the screen
                                            //and returns his value(We can compare it with a certain value and
                                            //take decisions if it is required from the user)
    {                                       
        unsigned char y, z = 0;
        unsigned int h_byte, l_byte, temp, b9, p, b8;
        unsigned char name[] = "Temperature";
        unsigned int a, b, x0, x2;
        unsigned char c = 0x30;     //For Conversion to ASCII
    
        lcd_ini();                  //Initializing the LCD
        for(y=192;y<203;y++)        //Change (increment) positions of Cursor from 0xC0 - D '192'(2nd line) to finishing the word "Temperature"
        {
        lcdcmd(0xC0);           //Set the Cursor on 2nd line in LCD screen
        MSDelay(15);
        lcdcmd(y);              //Set Cursor before printing   
        MSDelay(15);
        lcddata(name[z]);       //Print "TEMPERATURE" On LCD
        z++;
                        }
        lcdcmd(203);            //Set the Cursor after the word "Temperature" 
        MSDelay(15);
        lcddata('#');           //Print "#" On LCD
        TRISAbits.TRISA1 = 1;   //RA1(AN1) Analog INPUT
        TRISAbits.TRISA3 = 1;   //RA3 Used FOR Vref(external) 
        ADCON0 = 0b10001001;    //Programming ADCON0
        ADCON1 = 0xC5;          //Programming ADCON1
        MSDelay(250);

        MSDelay(1);             //Taq ---> signal stable
        ADCON0bits.GO = 1;              //Start Conversion
        while(ADCON0bits.DONE == 1);    //Wait the Conversion Process to be finished
        l_byte = ADRESL;                //then, we put the result (10 bits) in low byte (ADRESL) and high byte (ADRESH),                                                                                                                  
        h_byte = ADRESH;                //then we put the 2 least significant bits of the high byte in b8 and b9 (unsigned int).
        b8 = h_byte & 0x01;             //then, we check the values of these two bits (1 or 0).
        b9 = h_byte & 0x02;             //then, we add them all in temp variable (unsigned int).
        if(b8 > 0)                      //after that, we use a convenient coefficient to get real result (Hexadecimal).
            b8 = 256;     //2^8                  //.....
        else
            b8 = 0;
        
        if(b9 > 0)
            b9 = 512;     //2^9 
        else
            b9 = 0; 
        
        temp = b9 + b8 + l_byte;
        temp = temp * 0.1465;       //.............//
        p = temp ;
        a = temp;                   //Separating the Temperature value to Tens and Ones to
        b = a / 10;                 //display it character-by-character
        x0 = a % 10;
        x0 = c | x0;
        x2 = c | b;
    
