MohamadHammoud99/Automatic-Water-Irrigation-System/Microcontroller_PIC18F_Project.c
        MSDelay(15);
        lcdcmd(205);
        MSDelay(15);
        MSDelay(15);
        lcddata(x2);
        MSDelay(15);                //Print Temperature value with its Unit (C)
        lcdcmd(206);
        MSDelay(15);
        lcddata(x0);
        MSDelay(15);
        lcdcmd(207);
        lcddata('C');
        MSDelay(15);
        MSDelay(1000);
        
        return p ;
    }

unsigned int  MOISTURE (void)           //Function that reads from Moisture Sensor,
 {                                      //display his actual value on the screen and returns this value to compare it later on
    unsigned int d, y, z = 0;
    unsigned char name[] = "Moisture";
    unsigned int h_byte, l_byte, temp, u, b9, b8;
    unsigned char i,Hundreds,Tens,Ten;
     
    TRISAbits.TRISA0 = 1;       //RA0(AN0) Analog Input
    ADCON0=0b10000001;          //Programming ADCON0
    ADCON1=0b11000100;          //Programming ADCON1
    MSDelay(250);
    ADCON0bits.GO = 1;          //Start Conversion
    while(ADCON0bits.DONE == 1);        
    l_byte = ADRESL;
    h_byte = ADRESH;
    b8 = h_byte & 0x01;
    b9 = h_byte & 0x02;
    if(b8 > 0)
      b8 = 256;     //2^8
    else                         //Similar as Temperature Function but now for Moisture
      b8 = 0;
    if(b9 > 0)
      b9 = 512;     //2^9
    else
      b9 = 0; 
    temp = b9 + b8 + l_byte;
    d = (temp/(1.024));
    lcd_ini();
    for(y=128;y<139;y++)
    {
    lcdcmd(y);
    MSDelay(15);
    lcddata(name[z]);           //Print "MOISTURE" On LCD
    z++;
    }
    lcdcmd(0x89);               //Goto 9th place on first line of LCD
    MSDelay(15);
    i = d / 100;
    u = d / 10 ;                //This action is for take the integer value of the Moisture and compare it with 70(%) 
    Hundreds = i + 0x30;        
    lcddata(Hundreds);
    MSDelay(15);
    i = (d % 100 ) / 10;        //Separating the Moisture value to Tens and Ones to
    Ten = i + 0x30;             //display it character-by-character
    Tens = Ten + 1;
    lcddata (Tens);
    MSDelay(15);
    lcddata ('%');              //Display %
    MSDelay(1000);
    
    return u;                   //Returns the actual Moisture value to compare it later on
}

void MSDelay(unsigned int itime)   //Function used to make time Delay
{
     unsigned int i, j;
     for(i=0;i<itime;i++)
        for(j=0;j<135;j++);
}

void lcdcmd(unsigned char c)    //Function used to send command to the display
{
    ldata = c;          //PORTD = LCD data pins
    rs = 0;             //To send command
    rw = 0;             //To write on LCD
    en = 1;             //HIGH-to_LOW pulse for the E pin in the case of writing
    MSDelay(1);
    en = 0;
}

void lcddata(unsigned char d)    //Function used to send data to the display and print it.
{
    ldata = d;          //PORTD = LCD data pins
    rs = 1;             //To send data
    rw = 0;             //To write on LCD
    en = 1;             //HIGH-to_LOW pulse for the E pin in the case of writing
    MSDelay(1);
    en = 0;
}

void lcd_ini (void)    //Function used to initialize the LCD
{
    MSDelay(250);
    en = 0;
    lcdcmd(0x01);       //Clears the LCD display 
    MSDelay(15);
    lcdcmd(0x38);       //Make 2 lines and 5 x 7 matrix in LCD
    MSDelay(15);
    lcdcmd(0x0E);       //Make Cursor blinking ON
}

void LCD_write_string(static char *str)     //Function used to Print String (Message) on the Screen of the LCD
{
    unsigned int i = 0;
    while (str[i] != 0)
        {
            lcddata(str[i]);        //Sending Data on LCD byte-by-byte
            MSDelay(15);
            i++;
        }
    MSDelay(250);
}
    
void Stop (void)            //Function used to check if the key '3' of Keypad is pressed ---> Stop all processes, Turn OFF Green LED,
                            //Turn ON Red LED and Print "PROCESS OFF" On the Screen
{
    unsigned char msg3[] = "PROCESS OFF";
     if (c3 == 0)    //When key '3' is pressed, both pumps were be deactivated
   {
        PUMP2 = 0;      //Deactivate the Irrigation Pump
        PUMP1 = 0;      //Deactivate the Tank Filling Pump if the Full Sensor detects water
        RLED = 1;       //Turn ON Red LED (Process OFF)
        GLED = 0;       //Turn OFF Green LED (Process OFF)
        lcd_ini();                  //Initializing the LCD
        LCD_write_string(msg3);     //Call the LCD_write_string function to write "PROCESS OFF" on the Screen
        MSDelay(8000);              //Delay to display these messages for more time to the user
    }
}

void ALLError(void)         //Function that detect the Sensors Errors those are possible, Also the warning of high temperature in Automatic Mode;
                            //for example, if the Full Sensor detects water but the Empty Sensor does not detect it!!!
                            //Also if the temperature exceeds 40 degree Celsius ----> Warning!!!
    {
        unsigned char msg4[] = "SENSOR ERROR";
        unsigned char msg7[] = "RESET SYSTEM";
        unsigned char msg8[] = "AFTER SOLVING";
        unsigned char msg9[] = "SENSORS PROBLEM";  
        unsigned char msg10[] = "BE CAREFUL";
        unsigned char msg11[] = "HIGH TEMPERATURE";
        unsigned char msg12[] = "IRRIGATE MORE";
        unsigned char msg13[] = "MANUALLY BE SAFE";
        
        
        unsigned int t3, m3;
        
        if(FSENSOR == 1 && ESENSOR != 1)        //The Full Sensor detects water but the Empty Sensor does not detect it!!!
                {
                while(1){
                        c3 = 0;
                        Stop();         //Stop all processes
                        lcd_ini();      //Initializing the LCD
                        MSDelay(15);
                        LCD_write_string(msg4);     //Call the LCD_write_string function to write "SENSOR ERROR" on the Screen
                        MSDelay(200);               //Delay to display these messages for more time to the user
                        lcdcmd(192);
                        LCD_write_string(msg7);     //Call the LCD_write_string function to write "RESET SYSTEM" on the Screen
                        MSDelay(1000);              //Delay to display these messages for more time to the user
                        lcd_ini();                  //Initializing the LCD
                        MSDelay(15);
                        LCD_write_string(msg8);     //Call the LCD_write_string function to write "AFTER SOLVING" on the Screen
                        MSDelay(200);               //Delay to display these messages for more time to the user
                        lcdcmd(192);
                        LCD_write_string(msg9);     //Call the LCD_write_string function to write "SENSORS PROBLEM" on the Screen
                        MSDelay(1000);              //Delay to display these messages for more time to the user         
                            }
                }
        t3 = Temperature();
        m3 = MOISTURE();
        if (t3 > 40)
        {
            while(1){
                        c3 = 0;         //Force pressing on stop key (in program without pressing physically on the keypad)
                        Stop();         //Stop all processes
                        lcd_ini();      //Initializing the LCD
                        MSDelay(15);
                        LCD_write_string(msg10);     //Call the LCD_write_string function to write "BE CAREFUL" on the Screen
                        MSDelay(200);                //Delay to display these messages for more time to the user
                        lcdcmd(192);                 //Jump to the 2nd line (Cursor)
                        LCD_write_string(msg11);     //Call the LCD_write_string function to write "HIGH TEMPERATURE" on the Screen
                        MSDelay(1000);               //Delay to display these messages for more time to the user
                        lcd_ini();                   //Initializing the LCD
                        LCD_write_string(msg7);      //Call the LCD_write_string function to write "RESET SYSTEM" on the Screen
                        MSDelay(1000);               //Delay to display these messages for more time to the user
                        lcd_ini();                   //Initializing the LCD
                        LCD_write_string(msg12);     //Call the LCD_write_string function to write "IRRIGATE MORE" on the Screen                                
                        lcdcmd(192);                 //Jump to the 2nd line (Cursor)            
                        MSDelay(15);                          
                        LCD_write_string(msg13);     //Call the LCD_write_string function to write "MANUALLY BE SAFE" on the Screen
                        MSDelay(1000);               //Delay to display these messages for more time to the user
        }
    }
}

