MohamadHammoud99/Automatic-Water-Irrigation-System/Microcontroller_PIC18F_Project.c
void SError (void)      //Function that detect only the Sensors Errors
{
    unsigned char msg4[] = "SENSOR ERROR";
    unsigned char msg7[] = "RESET SYSTEM";
    unsigned char msg8[] = "AFTER SOLVING";
    unsigned char msg9[] = "SENSORS PROBLEM";
    
    if(FSENSOR == 1 && ESENSOR != 1)        //The Full Sensor detects water but the Empty Sensor does not detect it!!!
                {
                while(1){
                        c3 = 0;         //Force pressing on stop key (in program without pressing physically on the keypad)
                        Stop();         //Stop all processes
                        lcd_ini();      //Initializing the LCD
                        MSDelay(15);
                        LCD_write_string(msg4);     //Call the LCD_write_string function to write "SENSOR ERROR" on the Screen
                        MSDelay(200);               //Delay to display these messages for more time to the user
                        lcdcmd(192);                //Jump to the 2nd line (Cursor)
                        LCD_write_string(msg7);     //Call the LCD_write_string function to write "RESET SYSTEM" on the Screen
                        MSDelay(1000);              //Delay to display these messages for more time to the user
                        lcd_ini();                  //Initializing the LCD
                        MSDelay(15);
                        LCD_write_string(msg8);     //Call the LCD_write_string function to write "AFTER SOLVING" on the Screen
                        MSDelay(200);               //Delay to display these messages for more time to the user
                        lcdcmd(192);                //Jump to the 2nd line (Cursor)
                        LCD_write_string(msg9);     //Call the LCD_write_string function to write "SENSORS PROBLEM" on the Screen
                        MSDelay(1000);              //Delay to display these messages for more time to the user         
                            }
                }
}
